[
  {
    "Id": "485870",
    "ThreadId": "225134",
    "Html": "<p>Is there a posible to create a custom Gauss-Krueger based on false easting, false northing, central meridian and scale factor?</p>",
    "PostedDate": "2010-08-27T15:39:44.6-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "485935",
    "ThreadId": "225134",
    "Html": "<p>This Gauss-Krueger class is designed for german coordinates&nbsp;only (Potsdam Datum). We are planning to incorporate the austrian coordinate system (Datum Austria).&nbsp;Are you planning to use it for the&nbsp;german coordinate system only? If so, we may entend the class with this functionality.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-08-28T00:50:07.523-07:00",
    "UserRole": "Owner",
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "485978",
    "ThreadId": "225134",
    "Html": "<p>Hi, actually I'm from Costa Rica(America), and as far as I know it's also used on many South America's countries. In my case I use as a reference WGS84 Datum and a based on Gauss-Krueger projection called CRTM05. CRTM05 is the Costa Rica standard. It uses a false easting of 500.000 meters, false northing of 0 meters, reference meridian is 84 W, reference paralel is 0 degrees and the scale factor is 0.9999. I'll hope you could help with this. Thanks.</p>",
    "PostedDate": "2010-08-28T06:52:31.367-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1301990",
    "ThreadId": "225134",
    "Html": "Hi,<br />\n<br />\nsorry for resurrecting this thread, but I just read:<br />\n&quot;We are planning to incorporate the austrian coordinate system (Datum Austria).&quot;<br />\n<br />\nThat would be great :-)<br />\n<br />\nBest regards,<br />\nHelmut<br />\n",
    "PostedDate": "2014-09-07T06:45:34.123-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1303399",
    "ThreadId": "225134",
    "Html": "Did you make it? Or are you still planning to add it?\r<br />\n<br />\nRegards!<br />\n",
    "PostedDate": "2014-09-10T15:48:29.82-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]