[
  {
    "Id": "1042060",
    "ThreadId": "443292",
    "Html": "Well hello there. <br />\nI am new to all this mapping programs, somehow found this program (set of programs? Why is there windows.presentation and windows.forms? ) online (of course ) and I am amazed. It is wonderful! First I used the windows forms version, but then i figured to try the other (presentation) and it was better looking with better feel (and the fact that it post a marker at the search result coordinates instead of just centering the map thee). I can not only browse cached maps when offline, but also search the map down to street name and number, which even google earth cant do (and google Earth has only satellite images available for its cache, pff).<br />\n.. BUT the only thing I really need now to marry it is gpx support. Google earth opens it up excellent, but this.. well, windows.presentation doesnt have that function at all and windows.forms doesnt want to import anything ( error (2.2) something) . I cant even export (save) manually created way-points (can I?), because it just.. well.. when I chose the location where to save and press &quot;save&quot; - nothing happens ( except for the save window closing, ofc.) - no file is created. <br />\nIf someone could enlighten me or, maybe, if the program cant handle such files, it can be made to handle (Feature request box - check). <br />\n<br />\nThe gpx I want to use is from geocaching (hide and seek world adventure .. stuff, know that?)<br />\nI uploaded it to my google drive, here: <a href=\"https://docs.google.com/file/d/0B96oKqGy81PsQ0I5dWljWW5ZSjg/edit?usp=sharing\" rel=\"nofollow\">https://docs.google.com/file/d/0B96oKqGy81PsQ0I5dWljWW5ZSjg/edit?usp=sharing</a><br />\n",
    "PostedDate": "2013-05-10T13:31:50.243-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1042169",
    "ThreadId": "443292",
    "Html": "maybe gpx version is old/new<br />\n",
    "PostedDate": "2013-05-11T01:02:06.833-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1042171",
    "ThreadId": "443292",
    "Html": "I tried searching this forums and you said to somebody else before that the gpx might be old and he should try changing it to 1.1 (I opened my in notepad and it says 1.0). I changed the 0 with a 1, but that made a different error - (1.16) :D \r<br />\nThe GPX contains coordinates, description of each points, is somehow able to load the geocaching logo un upper right corner..  in google Earth it looked almost like a webpage, with the ability to scroll down.  - too old or too new? \r<br />\nAre you planning on making advanced gpx reader in it?<br />\n",
    "PostedDate": "2013-05-11T01:12:04.937-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1042174",
    "ThreadId": "443292",
    "Html": "gpx is a standard, it's classes are generated automatically<br />\n",
    "PostedDate": "2013-05-11T01:16:56.243-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1042176",
    "ThreadId": "443292",
    "Html": "And that means .. ? Can you look at the gpx I uploaded and gave link to?<br />\n",
    "PostedDate": "2013-05-11T01:19:31.517-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1042178",
    "ThreadId": "443292",
    "Html": "looking doesn't change anything ;}<br />\n",
    "PostedDate": "2013-05-11T01:24:16.257-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1042179",
    "ThreadId": "443292",
    "Html": "But I dont get it - so why doesnt it open it and what should I do to open?<br />\n",
    "PostedDate": "2013-05-11T01:25:47.743-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1042182",
    "ThreadId": "443292",
    "Html": "whats the error?<br />\n",
    "PostedDate": "2013-05-11T01:36:33.253-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1042183",
    "ThreadId": "443292",
    "Html": "&quot;Error importing gpx: There is an error in XML document (2,2).&quot;\r<br />\n<br />\n.. and what about exporting a gpx ( &quot;to gpx&quot; button) ? It asks me where to save and then NOTHING happens? :/ I could at least manually create the waypoints and save them, but.. doesnt work (oh, and how to give a custom name to a waypoint?)<br />\n",
    "PostedDate": "2013-05-11T01:41:43.957-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1042185",
    "ThreadId": "443292",
    "Html": "export button is used to export gpx log from mobile gps log, work fine, i use it to upload gps tracks to openstreetmap<br />\n",
    "PostedDate": "2013-05-11T01:52:03.443-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]