[
  {
    "Id": "1093141",
    "ThreadId": "457064",
    "Html": "I´m using the GMAP.net library in a project and I found it was a powerful tool. It´s cache facility made it a real profit to my project. Anyway, I need if someone can tell me a little bit of how it works. As far as I tested it, I can see that it pre-allocates space (in my case about 200 mb), so I started doing some test seeing how it worked, and it turns out it works really well, but in some cases I have been viewing maps that haven´t been cached. I don´t know if I have to spent some time with the position on the map so It can be cached or something like that. Does the tile cache file size increases with the time?, or it just keeps the prealocated size?.\r<br />\n<br />\nThanks in advance for any possible answer.<br />\n",
    "PostedDate": "2013-09-16T08:07:06.497-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1093150",
    "ThreadId": "457064",
    "Html": "Prealocation is +32MB if there are no empty pages left, and there is no size limit. Caching is done asynchronously with the lowest thread priority.\r<br />\n<br />\nIf you want to cache some area, you can use integrated tile prefetcher in demos.<br />\n",
    "PostedDate": "2013-09-16T08:17:22.66-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1455816",
    "ThreadId": "457064",
    "Html": "Hey radioman\r<br />\n<br />\nI'm not sure if this thread is still open or if I have to make a new one?\r<br />\n<br />\nAnyway, does the cache have some kind of expiry set to it? I downloaded a large are into cache during testing, then left the project alone for a few days. After running my application again the cache was empty.\r<br />\nAm I maybe missing a setting?<br />\n",
    "PostedDate": "2015-12-14T00:50:47.753-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1455858",
    "ThreadId": "457064",
    "Html": "cache has no expiration, you can clean it using MainMap.Manager.PrimaryCache.<strong>DeleteOlderThan</strong>\r<br />\n<br />\nby default MainMap.Manager.Mode = AccessMode.<strong>ServerAndCache</strong> , meaning all downloaded tiles will be saved\r<br />\n<br />\nmaybe your mode is different, then no tiles would be saved, or maybe you closed your app too soon<br />\n",
    "PostedDate": "2015-12-14T06:45:36.403-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]