[
  {
    "Id": "184421",
    "ThreadId": "54695",
    "Html": "Hi<br>\r\n<br>\r\nFirstly, great control - thanks for the development. Unfortunately, I am bound to using Visual Studio Express which does not support solution folders. I used to be able to compile/run the solution but now everything breaks due to this problem. Would you consider not using solution folders (or using some other way of organising your code) for those of us stuck to the Express editions?<br>\r\n<br>\r\nThanks \r\n",
    "PostedDate": "2009-04-28T02:54:30.217-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "184467",
    "ThreadId": "54695",
    "Html": "hi, can you explain a little more what is '<span style=\"color:rgb(48, 51, 45);font-family:'segoe ui';font-size:13px\">solution folders', i never used express versions before ;/</span>",
    "PostedDate": "2009-04-28T05:01:38.643-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "184863",
    "ThreadId": "54695",
    "Html": "Well, I'm not really sure what solution folders are. All I know is that\r\nI get the following error when I load (the most recent version) of the\r\n.sln solution file:<br>\r\nSolution folders are not supported in this version of the application -\r\nSolution folder 'GMap.NET' will be displayed as unavailable.<br>\r\nThe error re-occurs for the 'Demo' folder as well.<br>\r\n<br>\r\n",
    "PostedDate": "2009-04-29T01:21:44.093-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "184866",
    "ThreadId": "54695",
    "Html": "Sorry for the confusion. The compilation errors are not related to the solution folders errors above. I just downloaded the source from the CodePlex site and everything compiles (still gives the errors above though). I was using svn to update my local copy of the code but there are obviously some files missing from the svn repository. Can you add these files when you get a chance?<br>\r\n",
    "PostedDate": "2009-04-29T01:25:19.493-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "185035",
    "ThreadId": "54695",
    "Html": "delete you old folder and checkout again, or just download newest zipped set of source from http://gmap4dotnet.codeplex.com/SourceControl/ListDownloadableCommits.aspx",
    "PostedDate": "2009-04-29T08:39:45.343-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]