[
  {
    "Id": "209834",
    "ThreadId": "61824",
    "Html": "<p>radioman,</p>\r\n<p>I know that this discussion group is meant for constructive help and development chat, but I hoped you wouldn't mind if I just posted a small agendaless thankyou for the creation of this control. I was undertaking a pretty big project that required the constant manipulation of a map in the user interface and was dreading having to delve deep into the Google mapping API until I stumbled across this. It's the first control I've found on codeplex that I've been able to just treat like a black box to try to do what I've wanted it to do and have it just work, every time, no matter what I throw at it. I've barely even had to look at the source code to figure out what I'm doing, it's brilliantly intuitive (and actively supported too!).</p>\r\n<p>I hope that the rest of the community here will join me in thanking you for this great bit of code wrangling! Keep up the great work!</p>",
    "PostedDate": "2009-07-08T02:32:40.477-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "214832",
    "ThreadId": "61824",
    "Html": "<p>your work is much appreciated.</p>\r\n<p>i've done some improvements on usability for the control. some minor tweaks. I'll merge them into the solution later on.</p>",
    "PostedDate": "2009-07-22T09:13:39.75-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "214849",
    "ThreadId": "61824",
    "Html": "<p>great!</p>\r\n<p>any screenshoots of applications using this control are welcome too, that one is used in 'my' trolley transport company &nbsp;:}</p>\r\n<p><img src=\"http://jjvkug.blu.livefilestore.com/y1pK7AqCyB3pTBR1OtlliSo4a3HZ2sxtktG-e7HlPepNerv1l-fBO9Amwl1H2zjFfnL68cTUGFHIaZ1BaVm8CeijsGlgnch_F1F/trolis new.png\" alt=\"\" width=888></p>\r\n<p><img src=\"http://czpxlw.blu.livefilestore.com/y1phuoGqiRW_DN2tMZ5EhgNbEn3apEXzk6xJ0Z8EcPAD_fCqMaHqosBEVN5J8_SDbdbaHEbRG5UrWugeayiXRUSZzSGwulC9J_m/trolis rocks.png\" alt=\"\" width=888></p>\r\n<p><img src=\"http://jjvkug.blu.livefilestore.com/y1pLxH_8gtCggPiPzkZMOeOG6BJeH9AgCDUSD4OKK2HRWgZSUjgCNNcfS4wv3ooM6F2Dt7-V9KLrSXFBaxvo-LmvP9SQif83eyM/trolis-demo.png\" alt=\"\" width=888></p>",
    "PostedDate": "2009-07-22T09:49:58.987-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "378266",
    "ThreadId": "61824",
    "Html": "<p>this project is pure awesome</p>",
    "PostedDate": "2010-02-24T17:00:51.897-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "406812",
    "ThreadId": "61824",
    "Html": "<p>Totally agree. Some more screenshots from my mobile phone:</p>\r\n<p><img src=\"http://home.online.no/~sthexeb/TurKart/1ScreenShot7 (2).Png\" border=0 alt=\"\"> <img src=\"http://home.online.no/~sthexeb/TurKart/ScreenShot10.Png\" border=0 alt=\"\"> <img src=\"http://home.online.no/~sthexeb/TurKart/ScreenShot3.png\" border=0 alt=\"\"> <img src=\"http://home.online.no/~sthexeb/TurKart/1ScreenShot7 (3).Png\" border=0 alt=\"\"></p>",
    "PostedDate": "2010-02-25T14:19:40.28-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "466877",
    "ThreadId": "61824",
    "Html": "<p>Really appreciate the work you've done, Radioman. Trying your WinMo classes next.</p>\r\n<p><img src=\"http://img257.imageshack.us/img257/6881/workk.png\" border=0 alt=\"\"></p>",
    "PostedDate": "2010-07-13T09:13:18.077-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "471909",
    "ThreadId": "61824",
    "Html": "<p>Thank for your library.</p>\r\n<p>I thought I might share what I've done. Nothing amazing but I have created a simple server to track a police car as a demo. Added a car icon which changes colour based on ignition and siren. The tracking unit uses a GSM and ARM processor which I written the code for and Gmap.net was very useful to showcase the tracking unit.</p>\r\n<p>http://www.youtube.com/watch?v=_WJLDLymLKM</p>\r\n<p>Thanks again. Keep up the great work.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-07-23T19:52:17.567-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "645116",
    "ThreadId": "61824",
    "Html": "<p>Hi radioman,<br /> <br /> I am currently working on a project. A Proof of Concept (PoC). It is based on Windows 7 sensor library, Geosense for Windows and now uses Gmap.NET. This project demonstrates how to use the Wi-Fi triangulation without Global Position System (GPS) hardware.</p>\n<p>This is a screenshot :</p>\n<p><img title=\"GeoLock\" src=\"http://computerdomain.free.fr/divers/geolock.jpg\" alt=\"GeoLock\" /></p>\n<p>Thanks for all!<br /> neojudgment</p>",
    "PostedDate": "2011-07-20T11:20:11.337-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "664233",
    "ThreadId": "61824",
    "Html": "<p>Hey radioman!</p>\n<p>I'm a volunteer fire fighter in austria. When we have a turnout, all we get is a simple pager message with the location. Most of them are simple locations but sometimes you need some time 'uagh, where is that f**** street?'<br /> So i made this one:</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>Thanks a lot!!</p>",
    "PostedDate": "2011-08-27T07:27:31.14-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "681801",
    "ThreadId": "61824",
    "Html": "<p>Great work Radioman.. shame about Google.. did not expect that kind of behaviour from them.. makes me kind of sad that even Google can be a pain!</p>\r\n<p>Anyway.. This is the reason I use GMap.Net, an application to keep track of the current stability status of levees (protection against flooding).&nbsp;</p>\r\n<p>Thx for your great work!</p>\r\n<p><img src=\"http://safor.nl/img/smartdike.jpg\" alt=\"\" /></p>",
    "PostedDate": "2011-10-09T08:29:28.707-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "698574",
    "ThreadId": "61824",
    "Html": "<p>radioman, thanks so very much for this quality control. It saved me lots of time and effort, and your work does it's job fantastic in my winforms app, (fast drawing!)</p>\r\n<p>Downside is it makes me feel like a lazy programmer because everything i need is already there ;)</p>",
    "PostedDate": "2011-11-15T11:26:16.78-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "928966",
    "ThreadId": "61824",
    "Html": "\r\n<p>application by <a href=\"http://www.codeplex.com/site/users/view/mike_mankus\" target=\"_blank\">\r\nhttp://www.codeplex.com/site/users/view/mike_mankus</a><br>\r\n<br>\r\n<img src=\"http://s7.postimage.org/fvqg5ad63/SC1.png\" alt=\"\"><br>\r\n<br>\r\n&quot;Here's an example of the program in use. User sees a map of where they are via GPS (custom green circle GMapMarker). GPS history track shown in red (GMapRoute). Computer is talking to some radio equipment over USB/ethernet to get an instantaneous bearing towards\r\n a transmitter and see what the power spectrum looks like for that frequency (Bearing is shown in blue using GMapRoute which constantly updates). I wrote an algorithm to geo-locate the transmitter based on signal strength and bearing measurements and display\r\n the probability cloud over the map. That is the red and yellow cloud you are seeing in the center. Tells the user exactly where to drive to find the transmitter. I'm using a GMapImage for that. I'm made a bunch of different custom markers (in red) for displaying\r\n all licensed transmitters in the area. The user can also add marker their own markers (in green) which allows the user to add custom commentary or notes (and assign a custom letter to the marker). Records all the data and can be used for playing back the information\r\n as well.<br>\r\n<br>\r\nFAA uses it to find interference on their frequencies.<br>\r\n<br>\r\nI had a previous version written in C where I created the map myself using a graphics canvas and mapping tiles from OSM and Google. It was very time consuming figuring out how to draw the tiles and logic for navigating the map. It was very primitive although\r\n it allowed panning, zooming, and switching from satellite to street view. But using your control in C# has been a huge improvement. As you already know, it's packed with features and allows me to focus on the purpose of the software rather than focusing on\r\n getting the map to work. It's been a blessing. So thank you again.&quot;<br>\r\n<br>\r\n<br>\r\n</p>\r\n",
    "PostedDate": "2012-10-18T12:27:52.83-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1092118",
    "ThreadId": "61824",
    "Html": "<a href=\"https://greatmaps.codeplex.com/discussions/443511#post1091883\" rel=\"nofollow\">https://greatmaps.codeplex.com/discussions/443511#post1091883</a>\r<br />\n<br />\n<em>&quot;I am making another $250 donation, regardless. This project is phenomenal and has solved so many problems for me over the last couple of years. Thanks for your continued hard work on this, I hope folks truly appreciate the power and capability of this product. Great freaking job!&quot;</em><br />\n",
    "PostedDate": "2013-09-13T00:14:46.167-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1252808",
    "ThreadId": "61824",
    "Html": "Just saw that you posted my screenshot to this thread. Thank you! When I saw the OP I decided I would post my screen shot as well but I see you did it for me. :-)<br />\n<br />\nTo circle back on what the OP said as well as praise and thanks I have given you in the past, this really is a fantastic piece of work. It's been so instrumental in assisting my agency to create the application pictured above. <br />\n<br />\nSince I posted that screenshot back in Oct 2012, a lot has changed within the application. It now takes even greater advantage of the extensibility you've built into the control. In addition, I built a companion application which allows us to command and control multiple clients running the original application. So you can perform RF tri-angulation on a larger scale using the information being collected from multiple clients. And the entire framework for both applications is built around GreatMaps.<br />\n<br />\nThanks again for your time and dedication. And thanks for making this project open source; although I agree with the OP that it's written well enough where I almost never need to go to the source to observe/change anything.<br />\n<br />\n<strong>Main Application</strong> - Can be used to geo-location radio frequency interference. We use this in mobile platforms such as aircraft and cars. We also install this at fixed locations. Picture is from use in a vehicle tracking a source of radio interference which was affected the Atlantic City International Airport in New Jersey. As you can see, the software has identified the location of the interference.<br />\n<a href=\"http://i60.tinypic.com/516koi.png\" rel=\"nofollow\"><img src=\"http://i60.tinypic.com/516koi.png\" alt=\"Image\" /></a><br />\n<br />\n<strong>Remote Application</strong> - We use this to connect to multiple remote installations of the Main Application over TCP/IP. We can connect to mobile sites (car/aircraft) or fixed sites. This gives us complete command and control of the connected sites all on one screen. We are actively using this in New York and Los Angeles to protect the airspace from radio interference. More cities are being installed in the near future. Picture is a simulation of the New York configuration (can't provide a picture of the real data).<br />\n<a href=\"http://i61.tinypic.com/wbucdi.png\" rel=\"nofollow\"><img src=\"http://i61.tinypic.com/wbucdi.png\" alt=\"Image\" /></a><br />\n",
    "PostedDate": "2014-06-04T04:54:17.247-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]