[
  {
    "Id": "1483509",
    "ThreadId": "657900",
    "Html": "Hey. I am new to this control (but loving it very much).\r<br />\n<br />\nI have a map (called googleMap). When I use the mouse scroll wheel to change zoom level it works fine. I also have a button on the form that will zoom in and one that will zoom out. I have those set to increment zoom by 1 (+= 1 or -= 1). Those work fine.\r<br />\n<br />\nWhat I am trying to accomplish is to allow a finer level of zooming (if possible). So I have written it so that if the Control key is pressed then the zoom level increment is smaller.\r<br />\n<br />\nIt appears to work but the map isn't changing it's zoom level. So I had it write the zoom level each time it was incremented. The zoom level is changed but the map doesn't zoom in. Until I click the button for the sixth time. \r<br />\n<br />\nI understand this sounds confusing. Here is my button code:<br />\n<pre><code>private void button1_Click(object sender, EventArgs e)\n        {\n            try\n            {\n                if (Control.ModifierKeys == Keys.Control)\n                {\n                    googleMap.Zoom += 0.2;\n                }\n                else\n                {\n                    googleMap.Zoom += 1;\n                }\n                Console.WriteLine(googleMap.Zoom);                \n            }\n            catch (Exception ex)\n            {\n                                MessageBox.Show(&quot;Screw Up:&quot; + Environment.NewLine + &quot;Message: &quot; + ex.Message);                \n            }\n        }</code></pre>\n\nNow, here is the output from that Console.WriteLine:\r<br />\n11\r<br />\n12\r<br />\n12.2\r<br />\n12.4\r<br />\n12.6\r<br />\n12.8\r<br />\n13\r<br />\n13.2\r<br />\n<br />\nSo initially I was at a zoom level of 10. I clicked the button (without Control key pressed) and that changed to the 11 (and the map zoomed). I clicked again (still no Control key pressed) and the zoom changed to 12 and the map zoomed.\r<br />\n<br />\nThen I held down the control key and clicked the button 6 times (as you can see from the output). It wasn't until the 6th click (13.2) that the map zoomed in again.\r<br />\n<br />\nCan the zoom level only increment by 1 (or greater)? Or am I just screwing something up? I tend to think it's the second and that I'm doing it incorrectly.<br />\n",
    "PostedDate": "2016-09-12T11:36:43.097-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]