[
  {
    "Id": "237129",
    "ThreadId": "69663",
    "Html": "<p>Hi,</p>\r\n<p>Great work on the product. I really think you guys have done great work.</p>\r\n<p>I however have a problem under WPF. The only time I can get the maps to load is when I embed the Map Control in the Main Window of the application. I f I embed the control on another window which is opened seperately or in a Page that I display in a IFrame, the maps refuse to load. I have tried all your examples with no success. If I embed the Map Control in the Main Window and another sub window opened by the Main Window, the map in the Main Window opens without any problems. The other windows's map do&nbsp;not open although I used exactly the same code.</p>\r\n<p>If I make the Sub Window the startup window, it loads without any issues without changing any code.</p>\r\n<p>Any help will be appreciated.</p>\r\n<p>Thanks</p>",
    "PostedDate": "2009-09-21T22:12:56.893-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "237138",
    "ThreadId": "69663",
    "Html": "<p>as i expected it works just perfect ;} here i have made <a href=\"http://cid-e8bbd1bbd58dbc88.skydrive.live.com/self.aspx/.Public/Stuff/GMapTestWindowsWpfApplication.zip\">demo for you</a></p>",
    "PostedDate": "2009-09-21T22:40:53.233-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "237271",
    "ThreadId": "69663",
    "Html": "<p>Thanks. I did find the problem though ... The version I had still did not work ... Event with your demo. It was only when I referenced the DLL's provided by your example that everything started working. I did downloads the latest versions last week. I have subsequently today agaian downloaded the latest version and now my issue is resolved ;-)</p>\r\n<p>Thanks again.</p>",
    "PostedDate": "2009-09-22T05:22:35.913-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "237383",
    "ThreadId": "69663",
    "Html": "<p>great!, in future i&nbsp;recommend&nbsp;use latest version if&nbsp;possible</p>",
    "PostedDate": "2009-09-22T09:03:30.457-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]